#language: ru
@tree

@UH32_IFRS
@ERPUH32_IFRS


Функционал: 01. Под профилем "Администратор". Настройки (Сквозное планирование потребности = Нет)

	Как бизнес-аналитик я хочу
	проверить создание документов подситемы и закрытие регистров
	чтобы исключить ошибки

Контекст:

	И я закрыл все окна клиентского приложения

Сценарий: 01.00. Полные права: инициализация

	И я закрываю TestClient "УХ - НСИ"
	И я закрываю TestClient "УХ - Бюджетирование"
	И я закрываю TestClient "УХ - Закупки1"
	И я закрываю TestClient "УХ - Дымовые"	

	И Я запоминаю значение выражения 'ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() И НЕ ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ()' в переменную "$$ЭтоУХ$$"
	И Я запоминаю значение выражения 'ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() И ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ()' в переменную "$$ЭтоЕРПУХ$$"
	И Я запоминаю значение выражения 'ИдентификацияПродуктаУХКлиентСервер.ВерсияУправлениеХолдингом()' в переменную "$$ВерсияУХ$$"
	И Я запоминаю значение выражения 'СокрЛП(ТекущаяДата())' в переменную "$$ТекущаяДата$$"	
	И я устанавливаю в константу "ИспользоватьВыплатыСамозанятым" значение "Ложь"
	

	И я подключаю TestClient "УХ - МСФО" логин "Администратор" пароль ""
		

Сценарий: 01.05. Добавление настроек МСФО в организации

		
	* Настройки МСФО

		И В командном интерфейсе я выбираю "Учет по МСФО" "Настройки МСФО"
		Тогда открылось окно "Настройки МСФО"
		И я устанавливаю флаг с именем 'ИспользоватьУчетныеПолитикиМСФО'
		И я устанавливаю флаг с именем 'УчетПоСценариям'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Настройки МСФО *" в течение 20 секунд
		
	
	* Создаём новую Учётную политику МСФО

		И В командном интерфейсе я выбираю "Учет по МСФО" "Настройки МСФО"
		Тогда открылось окно "Настройки МСФО"
		И я разворачиваю группу с именем 'ГруппаТрансляция'
		И я нажимаю на кнопку с именем 'Открыть_УП'
		Тогда открылось окно "Учетные политики МСФО"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Учетная политика МСФО (создание)"
		И я нажимаю кнопку выбора у поля с именем 'ШаблонТрансляции'
		Тогда открылось окно "Шаблоны трансляций"
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		И в поле с именем 'Описание' я ввожу текст "МСФО 2"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Учетная политика МСФО (создание) *" в течение 20 секунд
		И Я закрываю окно "Учетные политики МСФО"
		И я жду закрытия окна "Учетные политики МСФО *" в течение 20 секунд
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Настройки МСФО *" в течение 20 секунд
			

	* Открываем справочник "Организации"

		И В командном интерфейсе я выбираю "Общие справочники и настройки" "Организации"
		Тогда открылось окно "Организации"

	* Выбираем организацию "Магнус"

		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Магнус ООО"   |
		И в таблице 'Список' я выбираю текущую строку
		
	* Действия в разделе Учётная политика МСФО

		
		Когда открылось окно "Магнус ООО (Организация)"
		И я перехожу к закладке с именем 'ГруппаПараметрыУчетаМСФОУХ'
		И у поля с именем 'УПМСФО1' я нажимаю гиперссылку 'Установить новую'
		Тогда открылось окно "Установки учетных политик (создание)"
		И я нажимаю кнопку выбора у поля с именем 'УчетнаяПолитика'
		Тогда открылось окно "Учетные политики МСФО"
		И в таблице 'Список' я перехожу к строке:
			| "Описание" |
			| "МСФО 2"   |
		И в таблице 'Список' я активизирую поле с именем 'Номер'
		И я нажимаю на кнопку с именем 'ФормаВыбрать'		
		И я нажимаю кнопку выбора у поля с именем 'Период'
		И в поле с именем 'Период' я ввожу текст "14.03.2022"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Установки учетных политик (создание) *" в течение 20 секунд
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Магнус ООО (Организационная единица)" в течение 20 секунд		
		И Я закрываю окно "Организации"


		* Фиксированные счета учёта

		И В командном интерфейсе я выбираю "Учет по МСФО" "Настройки МСФО"
		Тогда открылось окно "Настройки МСФО"
		И я нажимаю на кнопку с именем 'Открыть_ФиксированныеСчетаУчета'
		Тогда открылось окно "Фиксированные счета учета БД"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование"                 |
			| "039" | "Текущий финансовый результат" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Текущий финансовый результат (Фиксированные счета учета БД)"
		И в таблице 'ФиксированныеСчетаУчетаБД' я нажимаю на кнопку с именем 'ФиксированныеСчетаУчетаБДСоздать'
		Тогда открылось окно "Фиксированные счета БД (создание)"
		И я нажимаю кнопку выбора у поля с именем 'УчетнаяПолитика'
		Тогда открылось окно "Выбор типа данных"
		И в таблице 'TypeTree' я перехожу к строке:
			| "Колонка1"               |
			| "План счетов ИБ" |
		И я нажимаю на кнопку с именем 'OK'
		Тогда открылось окно "Фиксированные счета БД (создание) *"
		И из выпадающего списка с именем 'УчетнаяПолитика' я выбираю точное значение "План счетов МСФО"
		И я нажимаю кнопку выбора у поля с именем 'Счет'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код"  | "Наименование"                 |
			| "0000" | "Вспомогательный забалансовый" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Фиксированные счета БД (создание) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Фиксированные счета БД (создание) *" в течение 20 секунд
		Тогда открылось окно "Текущий финансовый результат (Фиксированные счета учета БД)"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Текущий финансовый результат (Фиксированные счета учета БД)" в течение 20 секунд
		Тогда открылось окно "Фиксированные счета учета БД"
		И Я закрываю окно "Фиксированные счета учета БД"
		Тогда открылось окно "Настройки МСФО"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Настройки МСФО" в течение 20 секунд


	* План счетов МСФО

		И В командном интерфейсе я выбираю "Учет по МСФО" "Настройки МСФО"
		Тогда открылось окно "Настройки МСФО"
		И я разворачиваю группу с именем 'ГруппаЗначенияПоУмолчанию'
		И из выпадающего списка с именем 'ПланСчетовПоУмолчанию' я выбираю точное значение "План счетов МСФО"
		И я нажимаю на кнопку открытия поля с именем 'ПланСчетовПоУмолчанию'
		Тогда открылось окно "МСФО (план счетов ИБ)"
		И в таблице 'ПланСчетов' я перехожу к строке:
			| "Код счета" | "Наименование счета" |
			| "111"       | "111"                |
		И в таблице 'ПланСчетов' я активизирую поле с именем 'ПланСчетовНаименование'
		И в таблице 'ПланСчетов' я выбираю текущую строку
		Тогда открылось окно "* (Счет МСФО)"
		И я нажимаю кнопку выбора у поля с именем 'Раздел'
		Тогда открылось окно "Категории счетов"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"             |
			| "Взаиморасчеты - BS AR/AP" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "* (Счет МСФО) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "* (Счет МСФО) *" в течение 20 секунд
		Тогда открылось окно "МСФО (план счетов ИБ)"
		И в таблице 'ПланСчетов' я нажимаю на кнопку с именем 'ПланСчетовСоздать'
		Тогда открылось окно "Счет МСФО (создание)"
		И в поле с именем 'Код' я ввожу текст "222"
		И в поле с именем 'Наименование' я ввожу текст "222"
		И я нажимаю кнопку выбора у поля с именем 'Раздел'
		Тогда открылось окно "Категории счетов"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"                           |
			| "Прочие доходы и расходы - PL NSE / NSI" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Счет МСФО (создание) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Счет МСФО (создание) *" в течение 20 секунд
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "МСФО (план счетов ИБ)" в течение 20 секунд
		Тогда открылось окно "Настройки МСФО *"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Настройки МСФО *" в течение 20 секунд
				
			

Сценарий: 01.06. Создание объектов ВНА

	* Добавление НЗС

		И В командном интерфейсе я выбираю "НСИ и администрирование" "Внеоборотные активы"
		Тогда открылось окно "Внеоборотные активы"
		И я устанавливаю флаг с именем 'ИспользоватьУправлениеРемонтами'
		И я устанавливаю флаг с именем 'ИспользоватьУзлыОбъектовЭксплуатации'
		И я устанавливаю флаг с именем 'ИспользоватьОбъектыСтроительства'
		И Пауза 30
		И Я закрываю окно "Внеоборотные активы"
				
		
	* Создание Направление деятельности

		И В командном интерфейсе я выбираю "НСИ и администрирование" "Направления деятельности"
		Тогда открылось окно "Направления деятельности"
		И я нажимаю на кнопку с именем 'СписокСоздать'
		Тогда открылось окно "Направление деятельности (создание)"
		И в поле с именем 'Наименование' я ввожу текст "МСФО 75"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Направление деятельности (создание) *" в течение 20 секунд
		Тогда открылось окно "Направления деятельности"
		И Я закрываю окно "Направления деятельности"


	* Создание Параметров учёта ВНА

		И В командном интерфейсе я выбираю "Учет по МСФО" "Настройки МСФО"
		Тогда открылось окно "Настройки МСФО"
		И я разворачиваю группу с именем 'ГруппаВНА'
		И я нажимаю на кнопку с именем 'Открыть_ГруппыВНА'
		Тогда открылось окно "Параметры учета ВНА"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "(Основное средство)"
		И в поле с именем 'Наименование' я ввожу текст "Основное средство - МСФО 2"
		И я нажимаю кнопку выбора у поля с именем 'СчетУчетаПервоначальнойСтоимости'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование"    |
			| "000" | "Вспомогательный" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Основное средство - МСФО 2(Основное средство) *"
		И я нажимаю кнопку выбора у поля с именем 'СчетНакопленнойАмортизации'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование"    |
			| "000" | "Вспомогательный" |
		И в таблице 'Список' я активизирую поле с именем 'Наименование'
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Основное средство - МСФО 2(Основное средство) *"
		И я меняю значение переключателя с именем 'МодельУчетаВНА' на "Учет по фактическим затратам"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Основное средство - МСФО 2(Основное средство) *" в течение 20 секунд
		Тогда открылось окно "Параметры учета ВНА"
		И Я закрываю окно "Параметры учета ВНА"
		Тогда открылось окно "Настройки МСФО"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Настройки МСФО" в течение 20 секунд
				

	* Создание объекта ОС

		И В командном интерфейсе я выбираю "Учет по МСФО" "Объекты эксплуатации"
		Тогда открылось окно "Объекты эксплуатации"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Объект эксплуатации (создание)"
		И из выпадающего списка с именем 'ГруппаОС' я выбираю точное значение "Здания"
		И в поле с именем 'Наименование' я ввожу текст "ОС - МСФО 8"
		
		И я перехожу к закладке с именем 'ГруппаМСФО'
		И я меняю значение переключателя с именем 'ВариантУчетаВНА' на "Параллельный учет"
		И я нажимаю кнопку выбора у поля с именем 'КлассВНА'
		
		Тогда открылось окно "Классы ВНА"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Классы ВНА (создание)"
		И в поле с именем 'Наименование' я ввожу текст "Транспортное средство"
		И я нажимаю кнопку выбора у поля с именем 'ПараметрыУчетаВНА'
		Тогда открылось окно "Параметры учета ВНА"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"               |
			| "Основное средство - МСФО 2" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Классы ВНА (создание) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Классы ВНА (создание) *" в течение 20 секунд
		Тогда открылось окно "Классы ВНА"
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
			
		Тогда открылось окно "Объект эксплуатации (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'ПараметрыУчетаВНА'
		Тогда открылось окно "Параметры учета ВНА"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"               |
			| "Основное средство - МСФО 2" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Объект эксплуатации (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'ДатаСведений'
		И в поле с именем 'ДатаСведений' я ввожу текст "02.01.2023"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Объект эксплуатации (создание) *" в течение 20 секунд
		Тогда открылось окно "Объекты эксплуатации"
		И Я закрываю окно "Объекты эксплуатации"

	* Создание объекта НМА

		* И В командном интерфейсе я выбираю "Учет по МСФО" "Нематериальные активы"
		* Тогда открылось окно "Нематериальные активы и расходы на НИОКР"
		* И я нажимаю на кнопку с именем 'ФормаСоздать'
		* Тогда открылось окно "Нематериальный актив (создание)"
		* И в поле с именем 'Наименование' я ввожу текст "НМА - МСФО 8"
		* И из выпадающего списка с именем 'ВидНМА' я выбираю точное значение "Произведения науки, литературы и искусства"
		* И я разворачиваю группу с именем 'ГруппаМСФО'
		* И я нажимаю кнопку выбора у поля с именем 'КлассВНА'
		* Тогда открылось окно "Классы ВНА"
		* И я нажимаю на кнопку с именем 'ФормаВыбрать'
		* Тогда открылось окно "Нематериальный актив (создание) *"
		* И я нажимаю кнопку выбора у поля с именем 'НаправлениеДеятельностиМСФО'
		* Тогда открылось окно "Направления деятельности"
		* И я нажимаю на кнопку с именем 'ФормаВыбрать'
		* Тогда открылось окно "Нематериальный актив (создание) *"
		* И я меняю значение переключателя с именем 'ВариантУчетаВНА' на "Параллельный учет"
		* И я нажимаю кнопку выбора у поля с именем 'ПараметрыУчетаВНА'
		* Тогда открылось окно "Параметры учета ВНА"
		* И я нажимаю на кнопку с именем 'ФормаВыбрать'
		* Тогда открылось окно "Нематериальный актив (создание) *"
		* И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		* И я жду закрытия окна "Нематериальный актив (создание) *" в течение 20 секунд
		* Тогда открылось окно "Нематериальные активы и расходы на НИОКР"
		* И Я закрываю окно "Нематериальные активы и расходы на НИОКР"
				
								
	* Создание объекта НЗС

		И В командном интерфейсе я выбираю "Учет по МСФО" "Объекты строительства"
		Тогда открылось окно "Объекты строительства"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Объект строительства (создание)"
		И в поле с именем 'Наименование' я ввожу текст "НЗС - МСФО 8"
		И я разворачиваю группу с именем 'ГруппаСведенияМСФО'
		И я нажимаю кнопку выбора у поля с именем 'КлассВНА'
		Тогда открылось окно "Классы ВНА"
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Объект строительства (создание) *"
		И я меняю значение переключателя с именем 'ВариантУчетаВНА' на "Параллельный учет"
		И я нажимаю кнопку выбора у поля с именем 'ПараметрыУчетаВНА'
		Тогда открылось окно "Параметры учета ВНА"
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Объект строительства (создание) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Объект строительства (создание) *" в течение 20 секунд
		Тогда открылось окно "Объекты строительства"
		И Я закрываю окно "Объекты строительства"
				
		
Сценарий: 01.07. Создание номенклатуры

	* Создание параметра расчёта резерва по запасам

		И В командном интерфейсе я выбираю "Учет по МСФО" "Настройки МСФО"
		Тогда открылось окно "Настройки МСФО"
		И я разворачиваю группу с именем 'ГруппаМПЗ'
		И я нажимаю на кнопку с именем 'ОткрытьМПЗ_ПараметрыРасчета'
		Тогда открылось окно "Параметры расчета резервов по запасам"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Параметры расчета резервов по запасам (создание)"
		И в поле с именем 'Наименование' я ввожу текст "Резерв по запасам 3"
		И из выпадающего списка с именем 'СпособОценкиРезерва' я выбираю точное значение "NRV тест"
		И я нажимаю кнопку выбора у поля с именем 'СчетРасхода'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование"    |
			| "000" | "Вспомогательный" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Параметры расчета резервов по запасам (создание) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Параметры расчета резервов по запасам (создание) *" в течение 20 секунд
		Тогда открылось окно "Параметры расчета резервов по запасам"
		И Я закрываю окно "Параметры расчета резервов по запасам"
		Тогда открылось окно "Настройки МСФО"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Настройки МСФО" в течение 20 секунд
				
	* Создание номенклатуры - учёт по МСФО как запаса

		И В командном интерфейсе я выбираю "НСИ и администрирование" "Номенклатура"
		Тогда открылось окно "Номенклатура"
		И я нажимаю на кнопку с именем 'СписокРасширенныйПоискНоменклатураСоздать'
		Тогда открылось окно "Номенклатура (создание)"
		И в поле с именем 'Наименование' я ввожу текст "Стол МСФО 8"
		И я разворачиваю группу с именем 'ГруппаУХ'
		И я нажимаю кнопку выбора у поля с именем 'ГруппаРасчетаРезерваМСФО'
		Тогда открылось окно "Параметры расчета резервов по запасам"
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Номенклатура (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'ВидНоменклатурыОбязательныеПоля'
		Тогда открылось окно "Виды номенклатуры"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Вид номенклатуры (создание)"
		И в поле с именем 'Наименование' я ввожу текст "МСФО 8"
		И из выпадающего списка с именем 'ТипНоменклатуры' я выбираю точное значение "Товар"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Вид номенклатуры (создание) *" в течение 20 секунд
		Тогда открылось окно "Виды номенклатуры"
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Номенклатура (создание) *"		
		И я нажимаю кнопку выбора у поля с именем 'ЕдиницаИзмерения'
		Тогда открылось окно "Выберите единицу измерения"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "шт"           |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Номенклатура (создание) *"		
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Номенклатура (создание) *" в течение 20 секунд
		Тогда открылось окно "Номенклатура"
		И Я закрываю окно "Номенклатура"

	* Создание номенклатуры - учёт по МСФО как ОС

		И В командном интерфейсе я выбираю "НСИ и администрирование" "Номенклатура"
		Тогда открылось окно "Номенклатура"
		И я нажимаю на кнопку с именем 'СписокРасширенныйПоискНоменклатураСоздать'
		Тогда открылось окно "Номенклатура (создание)"
		И в поле с именем 'Наименование' я ввожу текст "Стол МСФО 18"
		И я разворачиваю группу с именем 'ГруппаУХ'
		И я меняю значение переключателя с именем 'ВариантУчетаВНА' на "Параллельный учет в подсистеме ВНА"
		И я нажимаю кнопку выбора у поля с именем 'ПараметрыУчетаВНА'
		Тогда открылось окно "Параметры учета ВНА"
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Номенклатура (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'ЕдиницаИзмерения'
		Тогда открылось окно "Выберите единицу измерения"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "шт"           |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Номенклатура (создание) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Номенклатура (создание) *" в течение 20 секунд
		Тогда открылось окно "Номенклатура"
		И Я закрываю окно "Номенклатура"
			

Сценарий: 01.08. Заполнение основных блоков МСФО

	* Ввод событий ВНА

		И В командном интерфейсе я выбираю "Учет по МСФО" "Документы по ВНА"
		Тогда открылось окно "Документы по ВНА"
		И я нажимаю на кнопку с именем 'ФормаСоздатьПоПараметруВводСобытийВНАМСФО'
		Тогда открылось окно "Ввод событий ВНА (создание)"
		И я нажимаю кнопку выбора у поля с именем 'ПериодОтчета'
		Тогда открылось окно "Периоды"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "2020 г."      |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Ввод событий ВНА (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Организация'
		Тогда открылось окно "Организации"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование" |
			| "Магнус ООО"               |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Ввод событий ВНА (создание) *"
		И в таблице 'ВНА' я нажимаю на кнопку с именем 'ВНАЗаполнитьПоОснованиям'
		И в таблице 'ВНА' я нажимаю на кнопку с именем 'ВНАЗаполнитьИзУчетнойСистемыПоПроводкам'
		И в таблице 'ВНА' я нажимаю на кнопку с именем 'ВНАЗаполнитьТекущимиДаннымиНСБУ'
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Ввод событий ВНА (создание) *" в течение 20 секунд
		Тогда открылось окно "Документы по ВНА"
		И Я закрываю окно "Документы по ВНА"

	
	* Добавление Вида объекта финансового характера

		И В командном интерфейсе я выбираю "Учет по МСФО" "Настройки МСФО"
		Тогда открылось окно "Настройки МСФО"
		И я разворачиваю группу с именем 'ГруппаФИ'
		И я нажимаю на кнопку с именем 'ОткрытьФИ_ВидыФИ'
		Тогда открылось окно "Виды объектов финансового характера"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Виды объектов финансового характера (создание)"
		И в поле с именем 'Наименование' я ввожу текст "ЦБ по амортизированной стоимости МСФО"
		И я меняю значение переключателя с именем 'АктивОбязательство' на "Актив"
		И я меняю значение переключателя с именем 'СпособУчета' на "По амортизированной стоимости"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Виды объектов финансового характера (создание) *" в течение 20 секунд
		Тогда открылось окно "Виды объектов финансового характера"
		И Я закрываю окно "Виды объектов финансового характера"
		Тогда открылось окно "Настройки МСФО"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Настройки МСФО" в течение 20 секунд

	* Добавление Параметров учёта объектов финансового характера

		И В командном интерфейсе я выбираю "Учет по МСФО" "Настройки МСФО"
		Тогда открылось окно "Настройки МСФО"
		И я разворачиваю группу с именем 'ГруппаФИ'
		И я нажимаю на кнопку с именем 'ОткрытьФИ_ПараметрыФИ'
		Тогда открылось окно "Параметры учета объектов финансового характера"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Параметры учета объектов финансового характера (создание)"
		И в поле с именем 'Наименование' я ввожу текст "Ценная бумага МСФО (аморт)"
		И я нажимаю кнопку выбора у поля с именем 'ВидОбъектаФинансовогоХарактера'
		Тогда открылось окно "Виды объектов финансового характера"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"                          |
			| "ЦБ по амортизированной стоимости МСФО" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Параметры учета объектов финансового характера (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'СчетАктиваДолгосрочный'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование" |
			| "111" | "111"          |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Параметры учета объектов финансового характера (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'СчетАктиваКраткосрочный'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование" |
			| "111" | "111"          |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Параметры учета объектов финансового характера (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'СчетКраткосрочныхПроцентов'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование" |
			| "111" | "111"          |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Параметры учета объектов финансового характера (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'СчетАмортизацииПоправки'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование" |
			| "0000" | "Вспомогательный забалансовый"          |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Параметры учета объектов финансового характера (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'СчетНачисленияАванса'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование" |
			| "111" | "111"          |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Параметры учета объектов финансового характера (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'СчетДоходаОсновной'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование" |
			| "222" | "222"          |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Параметры учета объектов финансового характера (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'СчетРасходаОсновной'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование" |
			| "222" | "222"          |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Параметры учета объектов финансового характера (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'СчетДоходаПоПроцентам'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование" |
			| "222" | "222"          |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Параметры учета объектов финансового характера (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'СчетОбесценения'
		Тогда открылось окно "План счетов (МСФО): Счета ИБ"
		И в таблице 'Список' я перехожу к строке:
			| "Код" | "Наименование" |
			| "222" | "222"          |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Параметры учета объектов финансового характера (создание) *"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Параметры учета объектов финансового характера (создание) *" в течение 20 секунд
		Тогда открылось окно "Параметры учета объектов финансового характера"
		И Я закрываю окно "Параметры учета объектов финансового характера"
		Тогда открылось окно "Настройки МСФО"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Настройки МСФО" в течение 20 секунд


	
	* Добавление облигации

		И В командном интерфейсе я выбираю "Учет по МСФО" "Ценные бумаги"
		Тогда открылось окно "Ценные бумаги"
		И я нажимаю на кнопку с именем 'СоздатьОблигацию'
		Тогда открылось окно "Облигация (создание)"
		И в поле с именем 'Наименование' я ввожу текст "Облигация МСФО"
		И я нажимаю кнопку выбора у поля с именем 'Эмитент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я активизирую дополнение формы с именем 'СписокСтрокаПоиска'
		И в таблице 'Список' в дополнение формы с именем 'СписокСтрокаПоиска' я ввожу текст "банк"
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Облигация (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'ДатаВыпуска'
		И в поле с именем 'ДатаВыпуска' я ввожу текст "07.03.2022"
		И я нажимаю кнопку выбора у поля с именем 'СрокПогашения'
		И в поле с именем 'СрокПогашения' я ввожу текст "02.10.2023"
		И из выпадающего списка с именем 'ВалютаНоминала' я выбираю точное значение "RUB"
		И я разворачиваю группу с именем 'ГруппаМСФО'
		И я нажимаю кнопку выбора у поля с именем 'ПараметрыУчетаФИ'
		Тогда открылось окно "Параметры учета объектов финансового характера"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"               |
			| "Ценная бумага МСФО (аморт)" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Облигация (создание) *"
		И из выпадающего списка с именем 'УровеньИерархииСправедливойСтоимости' я выбираю точное значение "Уровень 1 - котируемые цены (некорректируемые) на активных рынках для идентичных активов или обязательств, к которым предприятие может получить доступ на дату оценки"
		И из выпадающего списка с именем 'ВалютаКотировки' я выбираю точное значение "RUB"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Облигация (создание) *" в течение 20 секунд
		Тогда открылось окно "Ценные бумаги"
		И Я закрываю окно "Ценные бумаги"
				
			
	* Добавление векселя

		И В командном интерфейсе я выбираю "Учет по МСФО" "Ценные бумаги"
		Тогда открылось окно "Ценные бумаги"
		И я нажимаю на кнопку с именем 'ФормаСоздатьВексель'
		Тогда открылось окно "Вексель (создание)"
		И в поле с именем 'Наименование' я ввожу текст "Вексель МСФО"
		И я нажимаю кнопку выбора у поля с именем 'ДатаВыпуска'
		И в поле с именем 'ДатаВыпуска' я ввожу текст "14.03.2022"
		И я разворачиваю группу с именем 'ГруппаУчетПоМСФО'
		И я нажимаю кнопку выбора у поля с именем 'ПараметрыУчетаФИ'
		Тогда открылось окно "Параметры учета объектов финансового характера"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"               |
			| "Ценная бумага МСФО (аморт)" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Вексель (создание) *"
		И я разворачиваю группу с именем 'ГруппаСтороны'
		И я нажимаю кнопку выбора у поля с именем 'Векселедатель'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я активизирую дополнение формы с именем 'СписокСтрокаПоиска'
		И в таблице 'Список' в дополнение формы с именем 'СписокСтрокаПоиска' я ввожу текст "банк"
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Вексель (создание) *"
		И я разворачиваю группу с именем 'ГруппаПлатеж'
		И из выпадающего списка с именем 'ВалютаНоминала' я выбираю точное значение "RUB"
		И в поле с именем 'Номинал' я ввожу текст "1 000,00"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Вексель (создание) *" в течение 20 секунд
		Тогда открылось окно "Ценные бумаги"
		И Я закрываю окно "Ценные бумаги"
				

	* Переоценка облигации

		И В командном интерфейсе я выбираю "Учет по МСФО" "Документы по финансовым инструментам"
		Тогда открылось окно "Документы по финансовым инструментам"
		И я нажимаю на кнопку с именем 'ФормаСоздатьПоПараметруПереоценкаФинансовыхИнструментов'
		Тогда открылось окно "Отражение финансовых инструментов по справедливой стоимости (создание)"
		И я нажимаю кнопку выбора у поля с именем 'ПериодОтчета'
		Тогда открылось окно "Периоды"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "2022 г."      |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Отражение финансовых инструментов по справедливой стоимости (создание) *"
		И из выпадающего списка с именем 'Организация' я выбираю точное значение "Магнус ООО"
		И в таблице 'ФинансовыеИнструменты' я нажимаю на кнопку с именем 'ФинансовыеИнструментыДобавить'
		И в таблице 'ФинансовыеИнструменты' я нажимаю кнопку выбора у реквизита с именем 'ФинансовыеИнструментыФИ'
		Тогда открылось окно "Выбор типа данных"
		И в таблице '' я перехожу к строке:
			| ""              |
			| "Ценная бумага" |
		И в таблице '' я выбираю текущую строку
		Тогда открылось окно "Ценные бумаги"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"   |
			| "Облигация МСФО" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Отражение финансовых инструментов по справедливой стоимости (создание) *"
		И в таблице 'ФинансовыеИнструменты' я активизирую поле с именем 'ФинансовыеИнструментыПараметрыУчетаФИ'
		И в таблице 'ФинансовыеИнструменты' я нажимаю кнопку выбора у реквизита с именем 'ФинансовыеИнструментыПараметрыУчетаФИ'
		Тогда открылось окно "Параметры учета объектов финансового характера"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"               |
			| "Ценная бумага МСФО (аморт)" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Отражение финансовых инструментов по справедливой стоимости (создание) *"
		И в таблице 'ФинансовыеИнструменты' я активизирую поле с именем 'ФинансовыеИнструментыСписаниеПереоценкиВД'
		И в таблице 'ФинансовыеИнструменты' я выбираю текущую строку
		И в таблице 'ФинансовыеИнструменты' в поле с именем 'ФинансовыеИнструментыСписаниеПереоценкиВД' я ввожу текст "5 000,00"
		И в таблице 'ФинансовыеИнструменты' я завершаю редактирование строки
		И в таблице 'ФинансовыеИнструменты' я нажимаю на кнопку с именем 'ПоказатьПодробно'
		И я нажимаю кнопку выбора у поля с именем 'ФинансовыеИнструментыДатаПризнанияФИ'
		И в поле с именем 'ФинансовыеИнструментыДатаПризнанияФИ' я ввожу текст "07.01.2022"
		И я нажимаю кнопку выбора у поля с именем 'ФинансовыеИнструментыНаправлениеДеятельности'
		Тогда открылось окно "Направления деятельности"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" | "Учет расчетов с поставщиками" |
			| "МСФО 75"      | "Нет"                          |
		И в таблице 'Список' я нажимаю на кнопку с именем 'СписокВыбрать'
		Тогда открылось окно "Отражение финансовых инструментов по справедливой стоимости (создание) *"
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Отражение финансовых инструментов по справедливой стоимости (создание) *" в течение 20 секунд
		Тогда открылось окно "Документы по финансовым инструментам"
		И Я закрываю окно "Документы по финансовым инструментам"
				
	
	* Резерв по ДЗ

		И В командном интерфейсе я выбираю "Учет по МСФО" "Резервы по ДЗ и авансам выданным"
		Тогда открылось окно "Резервы по ДЗ и авансам выданным"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Резервы по ДЗ и авансам выданным (создание)"
		И я нажимаю кнопку выбора у поля с именем 'ПериодОтчета'
		Тогда открылось окно "Периоды"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "2022 г."      |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Резервы по ДЗ и авансам выданным (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Организация'
		Тогда открылось окно "Организации"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование" |
			| "Магнус ООО"           |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Резервы по ДЗ и авансам выданным (создание) *"
		И я нажимаю на кнопку с именем 'РезервыРассчитать'
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Резервы по ДЗ и авансам выданным (создание) *" в течение 20 секунд
		И Я закрываю окно "Резервы по ДЗ и авансам выданным"

	* Резерв МПЗ

		И В командном интерфейсе я выбираю "Учет по МСФО" "Резервы по запасам"
		Тогда открылось окно "Резервы по запасам"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Резервы по запасам (создание)"
		И я нажимаю кнопку выбора у поля с именем 'ПериодОтчета'
		Тогда открылось окно "Периоды"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "2022 г."      |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Резервы по запасам (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Организация'
		Тогда открылось окно "Организации"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование" |
			| "Магнус ООО"           |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Резервы по запасам (создание) *"
		И я нажимаю на кнопку с именем 'РезервыЗаполнитьИРассчитать'
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Резервы по запасам (создание) *" в течение 20 секунд
		И Я закрываю окно "Резервы по запасам"	


Сценарий: 01.09. Финансовые инструменты РСБУ

	* Кредит (получение, начисление, погашение)

	* Кредитный договор

		И В командном интерфейсе я выбираю "Казначейство" "Договоры кредитов и депозитов"
		Тогда открылось окно "Договоры кредитов и депозитов"
		И в таблице 'Список' я нажимаю на кнопку с именем 'СписокСоздать'
		Тогда открылось окно "Выберите вид договора"
		И в таблице 'ВидыДоговоров' я перехожу к строке:
			| "Вид договора" |
			| "Кредит"       |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Кредит (создание)"
		И я нажимаю кнопку выбора у поля с именем 'ДатаДоговора'
		И в поле с именем 'ДатаДоговора' я ввожу текст "01.01.2021"
		И в поле с именем 'Наименование' я ввожу текст "Кредитный договор123 от 01.01.2021"
		И в поле с именем 'Номер' я ввожу текст "4525879"
		И я нажимаю кнопку выбора у поля с именем 'Организация'
		Тогда открылось окно "Организации"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование" | "Статус"    |
			| "Магнус ООО"           | "Действует" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Кредит (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "01.01.2021  0:00:00"
		И я нажимаю кнопку выбора у поля с именем 'Партнер'
		Тогда открылось окно "Партнеры"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Банк1"        |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Кредит (создание) *"
		И я перехожу к закладке с именем 'ГруппаРасчеты'
		И в поле с именем 'СуммаКредита' я ввожу текст "1 000 000,00"
		И я нажимаю кнопку выбора у поля с именем 'ДатаНачалаДействия'
		И в поле с именем 'ДатаНачалаДействия' я ввожу текст "01.01.2021"
		И я нажимаю кнопку выбора у поля с именем 'ДатаОкончанияДействия'
		И в поле с именем 'ДатаОкончанияДействия' я ввожу текст "31.12.2022"
		И я перехожу к следующему реквизиту
		И я разворачиваю группу с именем 'ГруппаРасчетПроцентовКредит'
		И в поле с именем 'ПроцентнаяСтавка' я ввожу текст "5,00"
		И я перехожу к следующему реквизиту
		И я перехожу к закладке с именем 'ГруппаГрафик'
		И я перехожу к закладке с именем 'ГруппаОсновное'
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Кредит (создание) *" в течение 40 секунд
		Тогда открылось окно "Договоры кредитов и депозитов"
		И Я закрываю окно "Договоры кредитов и депозитов"
			
	
	
	* Получение кредита	

		
		И В командном интерфейсе я выбираю "Казначейство" "Безналичные платежи"
		Тогда открылось окно "Безналичные платежи"
		И в таблице 'СписокПлатежей' я нажимаю на кнопку с именем 'СоздатьПоступлениеПоступлениеДенежныхСредствПоКредитам'
		Когда открылось окно "Поступление безналичных денежных средств (создание)"
		И я нажимаю кнопку выбора у поля с именем 'БанковскийСчет'
		Тогда открылось окно "Банковские счета организаций"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"                                  |
			| ""БМВ БАНК" ООО, Королевство Гор и Долин (RUB)" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Поступление безналичных денежных средств (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Контрагент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Банк1"        |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Поступление безналичных денежных средств (создание) *"	
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "01.01.2021  0:00:00"
		И я нажимаю кнопку выбора у поля с именем 'ДатаВходящегоДокумента'
		И в поле с именем 'ДатаВходящегоДокумента' я ввожу текст "01.01.2021"
		И в поле с именем 'НомерВходящегоДокумента' я ввожу текст "11122254"
		Когда открылось окно "Поступление безналичных денежных средств (создание) *"
		И я перехожу к закладке с именем 'СтраницаРасшифровка'
		И я нажимаю кнопку выбора у поля с именем 'РасшифровкаБезРазбиенияДоговорКредитаДепозита'
		Тогда открылось окно "Договоры кредитов и депозитов"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Выберите вид договора"
		И в таблице 'ВидыДоговоров' я перехожу к строке:
			| "Вид договора" |
			| "Кредит"       |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Кредит (создание)"
		И я нажимаю кнопку выбора у поля с именем 'ДатаДоговора'
		И в поле с именем 'ДатаДоговора' я ввожу текст "01.01.2021"
		И в поле с именем 'Номер' я ввожу текст "45587455"
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Кредит (создание) *" в течение 20 секунд
		Тогда открылось окно "Договоры кредитов и депозитов"
		И в таблице 'Список' я активизирую поле с именем 'Номер'
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Поступление безналичных денежных средств (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'РасшифровкаБезРазбиенияСтатьяДвиженияДенежныхСредств'
		Тогда открылось окно "Выбор статьи ДДС для операции *"
		И я меняю значение переключателя с именем 'РежимВыбора' на "Все статьи"
		И я перехожу к закладке с именем 'СтраницаВсе'
		И в таблице 'СписокВсе' я нажимаю на кнопку с именем 'СписокВсеСписок'
		И в таблице 'СписокВсе' я перехожу к строке:
			| "Статья ДДС"                            |
			| "Поступление денежных средств из банка" |
		И в таблице 'СписокВсе' я нажимаю на кнопку с именем 'СписокВсеВыбрать'
		Тогда открылось окно "Поступление безналичных денежных средств (создание) *"
		И я перехожу к закладке с именем 'СтраницаОсновное'
		И в поле с именем 'СуммаДокумента' я ввожу текст "1 000 000,00"
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Поступление безналичных денежных средств (создание) *" в течение 20 секунд
		Тогда открылось окно "Безналичные платежи"
		И Я закрываю окно "Безналичные платежи"
		


	* Погашение кредита		

		И В командном интерфейсе я выбираю "Казначейство" "Безналичные платежи"
		Тогда открылось окно "Безналичные платежи"
		И в таблице 'СписокПлатежей' я нажимаю на кнопку с именем 'СоздатьСписаниеОплатаПоКредитам'
		Тогда открылось окно "Списание безналичных денежных средств (создание)"
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "31.12.2023  0:00:00"
		И я нажимаю кнопку выбора у поля с именем 'ДатаВходящегоДокумента'
		И в поле с именем 'ДатаВходящегоДокумента' я ввожу текст "31.12.2023"
		И в поле с именем 'НомерВходящегоДокумента' я ввожу текст "544445"
		И я нажимаю кнопку выбора у поля с именем 'БанковскийСчет'
		Тогда открылось окно "Банковские счета организаций"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"                                  |
			| ""БМВ БАНК" ООО, Королевство Гор и Долин (RUB)" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Списание безналичных денежных средств (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Контрагент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Банк1"        |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Списание безналичных денежных средств (создание) *"
		И в поле с именем 'СуммаДокумента' я ввожу текст "1 000 000,00"
		И я перехожу к следующему реквизиту
		И я перехожу к закладке с именем 'СтраницаРасшифровка'
		И я нажимаю кнопку выбора у поля с именем 'РасшифровкаБезРазбиенияДокументПланирования'
		Тогда открылось окно "Выбор типа данных"
		И в таблице '' я перехожу к строке:
			| ""                               |
			| "Версия договора кредита, займа" |
		И я нажимаю на кнопку с именем 'OK'
		Тогда открылось окно "Версии договоров кредита, займа"
		И в таблице 'Список' я активизирую поле с именем 'ДоговорКонтрагента'
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Списание безналичных денежных средств (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'РасшифровкаБезРазбиенияДоговорКредитаДепозита'
		Тогда открылось окно "Договоры кредитов и депозитов"
		И в таблице 'Список' я перехожу к строке:
			| "Номер"    | 
			| "45587455" |
		И в таблице 'Список' я активизирую поле с именем 'Номер'
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Списание безналичных денежных средств (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'РасшифровкаБезРазбиенияСтатьяДвиженияДенежныхСредств'
		Тогда открылось окно "Выбор статьи ДДС для операции *"
		И я меняю значение переключателя с именем 'РежимВыбора' на "Все статьи"
		И я перехожу к закладке с именем 'СтраницаВсе'
		И в таблице 'СписокВсе' я активизирую поле с именем 'СписокВсеНаименование'
		И в таблице 'СписокВсе' я перехожу к строке:
			| "Статья ДДС"                            |
			| "Поступление денежных средств из банка" |
		И в таблице 'СписокВсе' я нажимаю на кнопку с именем 'СписокВсеВыбрать'
		Тогда открылось окно "Списание безналичных денежных средств (создание) *"
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Списание безналичных денежных средств (создание) *" в течение 20 секунд
		
			
					

	* Облигация (получение, начисление, погашение)

	* Заведение облигации

		И В командном интерфейсе я выбираю "Казначейство" "Ценные бумаги"
		Тогда открылось окно "Ценные бумаги"
		И я нажимаю на кнопку с именем 'СоздатьОблигацию'
		Тогда открылось окно "Облигация (создание)"
		И в поле с именем 'Наименование' я ввожу текст "Облигация МВ440"
		И я нажимаю кнопку выбора у поля с именем 'Эмитент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"            |
			| "Королевство Гор и Долин" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Облигация (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'ПервыйПолучатель'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Контрагент1"  |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Облигация (создание) *"
		И в поле с именем 'ДатаВыпуска' я ввожу текст "01.02.2021"
		И я перехожу к следующему реквизиту
		И в поле с именем 'СрокПогашения' я ввожу текст "31.12.2023"
		И я перехожу к следующему реквизиту
		И в поле с именем 'Номинал' я ввожу текст "1 500 000,00"
		И я перехожу к следующему реквизиту
		И из выпадающего списка с именем 'ВалютаНоминала' я выбираю точное значение "RUB"
		И я перехожу к следующему реквизиту
		И в поле с именем 'Количество' я ввожу текст "1,00"
		И я перехожу к следующему реквизиту
		И в поле с именем 'Серия' я ввожу текст "МВ"
		И в поле с именем 'Номер' я ввожу текст "440"
		И я перехожу к следующему реквизиту
		И я перехожу к закладке с именем 'ГруппаУсловия'
		И я меняю значение переключателя с именем 'ТипЦБ' на "Дисконт"
		И в поле с именем 'ЦенаВыпуска' я ввожу текст "1 300 000,00"
		И я перехожу к следующему реквизиту
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Облигация (создание) *" в течение 20 секунд
		Тогда открылось окно "Ценные бумаги"
		И Я закрываю окно "Ценные бумаги"
				
		
	* Приобретение облигации

		И В командном интерфейсе я выбираю "Казначейство" "Операции с ценными бумагами"
		Тогда открылось окно "Операции с ценными бумагами"
		И я нажимаю на кнопку с именем 'ФормаСоздатьПоПараметруПриобретениеЦеннойБумаги'
		Тогда открылось окно "Приобретение ценной бумаги (создание)"
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "01.02.2021  0:00:00"
		И я нажимаю кнопку выбора у поля с именем 'ФинансовыйИнструмент'
		Тогда открылось окно "Ценные бумаги"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"    |
			| "Облигация МВ440" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Приобретение ценной бумаги (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Организация'
		Тогда открылось окно "Организации"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование" |
			| "Королевство Гор и Долин"  |
		И в таблице 'Список' я активизирую поле с именем 'Наименование'
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Приобретение ценной бумаги (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Контрагент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Контрагент1"  |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Приобретение ценной бумаги (создание) *"
		И я нажимаю на кнопку открытия поля с именем 'Контрагент'
		Тогда открылось окно "Контрагент1 (Контрагент (юридическое или физическое лицо)"
		И я нажимаю на кнопку открытия поля с именем 'Партнер'
		Тогда открылось окно "Контрагент1 (Партнер)"
		И я изменяю флаг с именем 'Клиент'
		И я изменяю флаг с именем 'Поставщик'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Контрагент1 (Партнер) *" в течение 20 секунд
		Тогда открылось окно "Контрагент1 (Контрагент (юридическое или физическое лицо)"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Контрагент1 (Контрагент (юридическое или физическое лицо)" в течение 20 секунд
		Тогда открылось окно "Приобретение ценной бумаги (создание) *"		
		И я нажимаю кнопку выбора у поля с именем 'Договор'
		Тогда открылось окно "Договоры с контрагентами"
		И в таблице 'Список' я нажимаю на кнопку с именем 'СписокСоздать'
		Тогда открылось окно "Выберите вид договора"
		И в таблице 'ВидыДоговоров' я перехожу к строке:
			| "Вид договора"  |
			| "С поставщиком" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Договор с поставщиком / исполнителем (создание)"
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "01.01.2021"
		И в поле с именем 'Наименование' я ввожу текст "ДоговорОблигация от 01.01.2021"
		И я нажимаю кнопку выбора у поля с именем 'ДатаВерсии'
		И в поле с именем 'ДатаВерсии' я ввожу текст "01.01.2021  0:00:00"
		И в поле с именем 'СуммаДоговора' я ввожу текст "1 300 000,00"
		И я перехожу к следующему реквизиту
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Договор с поставщиком / исполнителем (создание) *" в течение 20 секунд
		Тогда открылось окно "Договоры с контрагентами"
		И в таблице 'Список' я нажимаю на кнопку с именем 'СписокВыбрать'
		Тогда открылось окно "Приобретение ценной бумаги (создание) *"		
		И в поле с именем 'Количество' я ввожу текст "1,00"
		И в поле с именем 'Стоимость' я ввожу текст "1 500 000,00"
		И я перехожу к следующему реквизиту
		И я нажимаю на кнопку с именем 'СчетаУчета'
		Тогда открылось окно "Счета учета документа"
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                 |
			| "Счет дохода от переоценки" | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' я нажимаю кнопку выбора у реквизита с именем 'СчетаУчетаСчет'
		Тогда открылось окно "План счетов бухгалтерского учета"
		И в таблице 'Список' я перехожу к строке:
			| "Код счета" |
			| "91.01"     |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"               | 
			| "Счет начисления купонов" | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "76"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета" |
			| "Счет НКД"  |
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "76"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                  | 
			| "Счет расхода от переоценки" |
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "91"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                                         | 
			| "Счет учета долгосрочного финансового инструмента " | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                         | 
			| "Счет учета долгосрочных процентов" |
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                      | 
			| "Счет учета процентов (купонов)" | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                          | 
			| "Счет учета финансового инструмента" | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И я нажимаю на кнопку с именем 'ФормаОК'
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Приобретение ценной бумаги (создание) *" в течение 20 секунд
		Тогда открылось окно "Операции с ценными бумагами"
		И Я закрываю окно "Операции с ценными бумагами"
				
	* Продажа облигации

		И В командном интерфейсе я выбираю "Казначейство" "Операции с ценными бумагами"
		Тогда открылось окно "Операции с ценными бумагами"
		И я нажимаю на кнопку с именем 'ФормаСоздатьПоПараметруПродажаЦеннойБумаги'
		Тогда открылось окно "Продажа ценной бумаги (создание)"
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "01.03.2022  0:00:00"
		И я нажимаю кнопку выбора у поля с именем 'ФинансовыйИнструмент'
		Тогда открылось окно "Ценные бумаги"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"    |
			| "Облигация МВ440" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Продажа ценной бумаги (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Организация'
		Тогда открылось окно "Организации"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование"    |
			| "Королевство Гор и Долин" |
		И в таблице 'Список' я активизирую поле с именем 'Наименование'
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Продажа ценной бумаги (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Контрагент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Контрагент1"  |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Продажа ценной бумаги (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Договор'
		Тогда открылось окно "Договоры с контрагентами"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование"           |
			| "ДоговорОблигация от 01.01.2021" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Продажа ценной бумаги (создание) *"
		И в поле с именем 'Количество' я ввожу текст "1,00"
		И я перехожу к следующему реквизиту
		И я нажимаю на кнопку с именем 'СчетаУчета'
		Тогда открылось окно "Счета учета документа"
		И в таблице 'СчетаУчета' я активизирую поле с именем 'СчетаУчетаСчет'
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "76"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"        |
			| "Счет выбытия НКД" |
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "76"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"               | 
			| "Счет доходов от выбытия" |
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "91"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                | 
			| "Счет расходов от выбытия" |
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "91"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И я нажимаю на кнопку с именем 'ФормаОК'
		Тогда открылось окно "Продажа ценной бумаги (создание) *"		
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Продажа ценной бумаги (создание) *" в течение 20 секунд
		Тогда открылось окно "Операции с ценными бумагами"
		И Я закрываю окно "Операции с ценными бумагами"
				
	* Выпуск облигации

		И В командном интерфейсе я выбираю "Казначейство" "Ценные бумаги"
		Тогда открылось окно "Ценные бумаги"
		И я нажимаю на кнопку с именем 'СоздатьОблигацию'
		Тогда открылось окно "Облигация (создание)"
		И в поле с именем 'Наименование' я ввожу текст "Облигация45897"
		И я нажимаю кнопку выбора у поля с именем 'Эмитент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Магнус ООО"   |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Облигация (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'ДатаВыпуска'
		И в поле с именем 'ДатаВыпуска' я ввожу текст "01.01.2021"
		И я нажимаю кнопку выбора у поля с именем 'СрокПогашения'
		И в поле с именем 'СрокПогашения' я ввожу текст "31.12.2023"
		И в поле с именем 'Номинал' я ввожу текст "10 000,00"
		И я перехожу к следующему реквизиту
		И из выпадающего списка с именем 'ВалютаНоминала' я выбираю точное значение "RUB"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Облигация (создание) *" в течение 20 секунд
		Тогда открылось окно "Ценные бумаги"
		И Я закрываю окно "Ценные бумаги"
		И В командном интерфейсе я выбираю "Казначейство" "Операции с ценными бумагами"
		Тогда открылось окно "Операции с ценными бумагами"
		И я нажимаю на кнопку с именем 'ФормаСоздатьПоПараметруВыпускЦеннойБумаги'
		Тогда открылось окно "Выпуск ценной бумаги (создание)"
		И я нажимаю кнопку выбора у поля с именем 'ФинансовыйИнструмент'
		Тогда открылось окно "Ценные бумаги"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"   |
			| "Облигация45897" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Выпуск ценной бумаги (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Контрагент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Контрагент1"  |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Выпуск ценной бумаги (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Договор'
		Тогда открылось окно "Договоры с контрагентами"
		И в таблице 'Список' я нажимаю на кнопку с именем 'СписокСоздать'
		Тогда открылось окно "Выберите вид договора"
		И в таблице 'ВидыДоговоров' я перехожу к строке:
			| "Вид договора"              |
			| "Универсальное привлечение" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Договор с поставщиком / исполнителем (создание)"
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "01.01.2021"
		И в поле с именем 'Номер' я ввожу текст "52847"
		И я нажимаю кнопку выбора у поля с именем 'ДатаВерсии'
		И в поле с именем 'ДатаВерсии' я ввожу текст "01.01.2021  0:00:00"
		И в поле с именем 'СуммаДоговора' я ввожу текст "1 000 000,00"
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Договор с поставщиком / исполнителем (создание) *" в течение 30 секунд
		Тогда открылось окно "Договоры с контрагентами"
		И в таблице 'Список' я активизирую поле с именем 'СписокНомер'
		И в таблице 'Список' я нажимаю на кнопку с именем 'СписокВыбрать'
		Тогда открылось окно "Выпуск ценной бумаги (создание) *"
		И в поле с именем 'Количество' я ввожу текст "1"
		И я нажимаю на кнопку с именем 'СчетаУчета'
		Тогда открылось окно "Счета учета документа"
		И в таблице 'СчетаУчета' я активизирую поле с именем 'СчетаУчетаСчет'
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю точное значение "76"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                                         |
			| "Счет учета долгосрочного финансового инструмента " ||
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю точное значение "76"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                         |
			| "Счет учета долгосрочных процентов" |
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю точное значение "76"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                      | 
			| "Счет учета процентов (купонов)" |
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю точное значение "76"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                          |
			| "Счет учета финансового инструмента" |
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю точное значение "76"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И я нажимаю на кнопку с именем 'ФормаОК'
		Тогда открылось окно "Выпуск ценной бумаги (создание) *"
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Выпуск ценной бумаги (создание) *" в течение 20 секунд
		Тогда открылось окно "Операции с ценными бумагами"
		И Я закрываю окно "Операции с ценными бумагами"
					
		

	* Выкуп облигации 	

		И В командном интерфейсе я выбираю "Казначейство" "Операции с ценными бумагами"
		Тогда открылось окно "Операции с ценными бумагами"
		И я нажимаю на кнопку с именем 'ФормаСоздатьПоПараметруВыкупЦеннойБумаги'
		Тогда открылось окно "Выкуп собственной ценной бумаги (создание)"
		И я нажимаю кнопку выбора у поля с именем 'ФинансовыйИнструмент'
		Тогда открылось окно "Ценные бумаги"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"    |
			| "Облигация45897" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Выкуп собственной ценной бумаги (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "01.02.2022  0:00:00"
		И я нажимаю кнопку выбора у поля с именем 'Контрагент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Контрагент1"  |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Выкуп собственной ценной бумаги (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Договор'
		Тогда открылось окно "Договоры с контрагентами"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование" |
			| "52847 от 01.01.2021"  |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Выкуп собственной ценной бумаги (создание) *"
		И в поле с именем 'Количество' я ввожу текст "1,00"
		И я перехожу к следующему реквизиту
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Выкуп собственной ценной бумаги (создание) *" в течение 20 секунд
		Тогда открылось окно "Операции с ценными бумагами"
		И Я закрываю окно "Операции с ценными бумагами"
				

	* Вексель (выпуск, начисление, погашение)

	* Заведение векселя

		И В командном интерфейсе я выбираю "Казначейство" "Ценные бумаги"
		Тогда открылось окно "Ценные бумаги"
		И я нажимаю на кнопку с именем 'ФормаСоздатьВексель'
		Тогда открылось окно "Вексель (создание)"
		И в поле с именем 'Наименование' я ввожу текст "Вексель123"
		И я нажимаю кнопку выбора у поля с именем 'ДатаВыпуска'
		И в поле с именем 'ДатаВыпуска' я ввожу текст "01.01.2021"
		И я разворачиваю группу с именем 'ГруппаСтороны'
		И я нажимаю кнопку выбора у поля с именем 'Векселедатель'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование"            |
			| "Королевство Гор и Долин" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Вексель (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'ПервыйПолучатель'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Контрагент1"  |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Вексель (создание) *"
		И я разворачиваю группу с именем 'ГруппаПлатеж'
		И в поле с именем 'Номинал' я ввожу текст "1 000 000,00"
		И из выпадающего списка с именем 'ВалютаНоминала' я выбираю точное значение "RUB"
		И я изменяю флаг с именем 'ПараметрыЦеннойБумагиПредусмотренПроцентныйДоход'
		И в поле с именем 'ПроцентнаяСтавка' я ввожу текст "4,00"
		И я перехожу к следующему реквизиту
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна "Вексель (создание) *" в течение 20 секунд
		Тогда открылось окно "Ценные бумаги"
		И Я закрываю окно "Ценные бумаги"

	* Выпуск векселя

		И В командном интерфейсе я выбираю "Казначейство" "Операции с векселями"
		Тогда открылось окно "Операции с векселями"
		И я нажимаю на кнопку с именем 'СоздатьВыпускПростыхВекселей'
		Тогда открылось окно "Регистрация векселя (создание)"
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "01.01.2021  0:00:00"
		И я нажимаю кнопку выбора у поля с именем 'Организация'
		Тогда открылось окно "Организации"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование" |
			| "Королевство Гор и Долин"  |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Регистрация векселя (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Контрагент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Контрагент1"              |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Регистрация векселя (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Договор'
		Тогда открылось окно "Договоры с контрагентами"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование"           |
			| "ДоговорОблигация от 01.01.2021" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Регистрация векселя (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Вексель'
		Тогда открылось окно "Векселя"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Вексель123"   |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Регистрация векселя (создание) *"
		И я нажимаю на кнопку с именем 'СчетаУчета'
		Тогда открылось окно "Счета учета документа"
		И в таблице 'СчетаУчета' я активизирую поле с именем 'СчетаУчетаСчет'
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "76"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И я нажимаю на кнопку с именем 'ФормаОК'
		Тогда открылось окно "Регистрация векселя (создание) *"
		И я нажимаю на кнопку с именем 'СчетаУчета'
		Тогда открылось окно "Счета учета документа"
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета" |
			| "Счет ДБП"  |
		И в таблице 'СчетаУчета' я активизирую поле с именем 'СчетаУчетаСчет'
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "98.01"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                         | 
			| "Счет учета долгосрочных процентов" | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                      | 
			| "Счет учета процентов (купонов)" | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И я нажимаю на кнопку с именем 'ФормаОК'
		Тогда открылось окно "Регистрация векселя (создание) *"		
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Регистрация векселя (создание) *" в течение 20 секунд
		Тогда открылось окно "Операции с векселями"
		И Я закрываю окно "Операции с векселями"
				

	* Погашение векселя

		И В командном интерфейсе я выбираю "Казначейство" "Операции с векселями"
		Тогда открылось окно "Операции с векселями"
		И я нажимаю на кнопку с именем 'СоздатьПогашениеСобственногоВекселя'
		Тогда открылось окно "Выбытие векселей (создание)"
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "01.01.2022  0:00:00"
		И я нажимаю кнопку выбора у поля с именем 'Организация'
		Тогда открылось окно "Организации"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование"    |
			| "Королевство Гор и Долин" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Выбытие векселей (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Контрагент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Контрагент1"  |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Выбытие векселей (создание) *"
		И из выпадающего списка с именем 'Вексель' я выбираю по строке "век"
		И в поле с именем 'СуммаОперации' я ввожу текст "1 100 000,00"
		И я перехожу к следующему реквизиту
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Выбытие векселей (создание) *" в течение 20 секунд
		Тогда открылось окно "Операции с векселями"
		И Я закрываю окно "Операции с векселями"


	* Покупка векселя

		И В командном интерфейсе я выбираю "Казначейство" "Операции с векселями"
		Когда открылось окно "Операции с векселями"
		И я нажимаю на кнопку с именем 'СоздатьПриобретениеВекселей'
		Тогда открылось окно "Регистрация векселя (создание)"
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "01.01.2021  0:00:00"
		И я нажимаю кнопку выбора у поля с именем 'Организация'
		Тогда открылось окно "Организации"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование"    |
			| "Королевство Гор и Долин" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Регистрация векселя (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Контрагент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Контрагент1"              |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Регистрация векселя (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Договор'
		Тогда открылось окно "Договоры с контрагентами"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование"           |
			| "ДоговорОблигация от 01.01.2021" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Регистрация векселя (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Вексель'
		Тогда открылось окно "Векселя"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Вексель123"   |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Регистрация векселя (создание) *"
		И я нажимаю на кнопку с именем 'СчетаУчета'
		Тогда открылось окно "Счета учета документа"
		И в таблице 'СчетаУчета' я активизирую поле с именем 'СчетаУчетаСчет'
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "76"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета" | 
			| "Счет ДБП"  |
		И в таблице 'СчетаУчета' я активизирую поле с именем 'СчетаУчетаСчет'
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "96"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                 | 
			| "Счет начисления процентов" |
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"     | 
			| "Счет номинала" | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета" | 
			| "Счет РБП"  | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "97"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                                         | 
			| "Счет учета долгосрочного финансового инструмента " |
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                         | 
			| "Счет учета долгосрочных процентов" | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                    | 
			| "Счет учета премии / дисконта" | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                      | 
			| "Счет учета процентов (купонов)" | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                          | 
			| "Счет учета финансового инструмента" |
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "58"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И я нажимаю на кнопку с именем 'ФормаОК'
		Тогда открылось окно "Регистрация векселя (создание) *"
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Регистрация векселя (создание) *" в течение 20 секунд
		Тогда открылось окно "Операции с векселями"
		И Я закрываю окно "Операции с векселями"


	* Продажа векселя

		И В командном интерфейсе я выбираю "Казначейство" "Операции с векселями"
		Тогда открылось окно "Операции с векселями"
		И я нажимаю на кнопку с именем 'СоздатьПродажаВекселя'
		Тогда открылось окно "Выбытие векселей (создание)"
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "01.01.2022  0:00:00"
		И я нажимаю кнопку выбора у поля с именем 'Организация'
		Тогда открылось окно "Организации"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование"    |
			| "Королевство Гор и Долин" |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Выбытие векселей (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Контрагент'
		Тогда открылось окно "Контрагенты (юридические или физические лица)"
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Контрагент1"  |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Выбытие векселей (создание) *"
		И я нажимаю кнопку выбора у поля с именем 'Договор'
		Тогда открылось окно "Договоры с контрагентами"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование"           |
			| "ДоговорОблигация от 01.01.2021" |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Выбытие векселей (создание) *"
		И из выпадающего списка с именем 'Вексель' я выбираю по строке "век"
		И в поле с именем 'СуммаОперации' я ввожу текст "1 100 000,00"
		И я перехожу к следующему реквизиту
		И я нажимаю на кнопку с именем 'СчетаУчета'
		Тогда открылось окно "Счета учета документа"
		И в таблице 'СчетаУчета' я активизирую поле с именем 'СчетаУчетаСчет'
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "76"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"               |
			| "Счет доходов от выбытия" | 
		И в таблице 'СчетаУчета' я активизирую поле с именем 'СчетаУчетаСчет'
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "91"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И в таблице 'СчетаУчета' я перехожу к строке:
			| "Вид счета"                | 
			| "Счет расходов от выбытия" | 
		И в таблице 'СчетаУчета' я выбираю текущую строку
		И в таблице 'СчетаУчета' из выпадающего списка с именем 'СчетаУчетаСчет' я выбираю по строке "91"
		И в таблице 'СчетаУчета' я завершаю редактирование строки
		И я нажимаю на кнопку с именем 'ФормаОК'
		Тогда открылось окно "Выбытие векселей (создание) *"
		И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
		И я жду закрытия окна "Выбытие векселей (создание) *" в течение 20 секунд
		Тогда открылось окно "Операции с векселями"
		И Я закрываю окно "Операции с векселями"




Сценарий: 01.10. Блок операций по закрытию периода и отчёты

	* Закрытие периода

				
		И В командном интерфейсе я выбираю "Учет по МСФО" "Закрытие периода МСФО"
		Тогда открылось окно "Закрытие периода МСФО"
		И я нажимаю кнопку выбора у поля с именем 'Организация'
		Тогда открылось окно "Организации"
		И в таблице 'Список' я перехожу к строке:
			| "Рабочее наименование" |
			| "Магнус ООО"           |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Закрытие периода МСФО"
		И я нажимаю кнопку выбора у поля с именем 'ПредставлениеПериодаРегистрации'
		Тогда открылось окно "Периоды"
		И я нажимаю на кнопку с именем 'ФормаНайти'
		Тогда открылось окно "Найти"
		И из выпадающего списка с именем 'Pattern' я выбираю по строке "20"
		И я меняю значение переключателя с именем 'CompareType' на "По началу строки"
		И я нажимаю на кнопку с именем 'Find'
		Тогда открылось окно "Периоды"
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		Тогда открылось окно "Закрытие периода МСФО"
		И я нажимаю на кнопку с именем 'КнопкаВыполнить'
		И Пауза 15
		И я жду, что таблица 'ТаблицаОпераций' станет равна данной в течение 30 секунд:
			| 'Операция закрытия'                                                  | 'Состояние'        |
			| 'Расчет резервов по сомнительным долгам'                             | 'Вводится вручную' |
			| 'Расчет резервов под снижение стоимости запасов'                     | 'Вводится вручную' |
			| 'Ввод событий ВНА'                                                   | 'Выполнено'        |
			| 'Признание ФИ по амортизированной стоимости'                         | 'Выполнено'        |
			| 'Изменение ФИ по амортизированной стоимости'                         | 'Выполнено'        |
			| 'Выбытие ФИ по амортизированной стоимости'                           | 'Выполнено'        |
			| 'Признание ФИ по справедливой стоимости'                             | 'Выполнено'        |
			| 'Переоценка ФИ по справедливой стоимости'                            | 'Выполнено'        |
			| 'Выбытие ФИ по справедливой стоимости'                               | 'Выполнено'        |
			| 'Регламентные операции параллельного учета (Финансовые инструменты)' | 'Выполнено'        |
			| 'Закрытие счетов запасов и затрат'                                   | 'Выполнено'        |
			| 'Расчет финансового результата'                                      | 'Выполнено'        |
			| 'Переоценка валютных активов обязательств'                           | 'Выполнено'        |
			| 'Распределение отложенных налогов по видам активов и обязательств'   | 'Выполнено'        |
			| 'Расчет отложенных налогов'                                          | 'Выполнено'        |
			| 'Реформация баланса'                                                 | 'Выполнено'        |
		И Я закрываю окно "Закрытие периода МСФО"

	* Отчёт ОСВ МСФО

		И В командном интерфейсе я выбираю "Учет по МСФО" "Оборотно сальдовая ведомость МСФО"
		Тогда открылось окно "Оборотно-сальдовая ведомость МСФО"
		И я нажимаю на кнопку с именем 'ВыбратьПериод1'
		Тогда открылось окно "Выбор периода"
		И я нажимаю на кнопку с именем 'ВыбратьГод'
		Тогда открылось окно "Оборотно-сальдовая ведомость МСФО"
		И из выпадающего списка с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент10Значение' я выбираю точное значение "Магнус ООО"
		Тогда открылось окно "Оборотно-сальдовая ведомость МСФО"
		И я нажимаю на кнопку с именем 'СформироватьОтчет'


		* Тогда область "R4C1:R6C1" табличного документа "ОтчетТабличныйДокумент" равна по шаблону:
		*	| 'Счет' |
			
		


		И Я закрываю окно "Оборотно-сальдовая ведомость МСФО"


	* Отчёт ОСВ по счёту МСФО

		И В командном интерфейсе я выбираю "Учет по МСФО" "Оборотно сальдовая ведомость по счету МСФО"
		Тогда открылось окно "Оборотно-сальдовая ведомость по счету МСФО"
		И я нажимаю на кнопку с именем 'ВыбратьПериод1'
		Тогда открылось окно "Выбор периода"
		И я нажимаю на кнопку с именем 'ПерейтиНаГодНазадДоступно'
		И я нажимаю на кнопку с именем 'ПерейтиНаГодНазадДоступно'
		И я нажимаю на кнопку с именем 'ВыбратьГод'
		Тогда открылось окно "Оборотно-сальдовая ведомость по счету МСФО"
		И из выпадающего списка с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент10Значение' я выбираю точное значение "Магнус ООО"
		Тогда открылось окно "Оборотно-сальдовая ведомость по счету МСФО"
		И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент2Значение'
		Тогда открылось окно "План счетов МСФО"
		И в таблице 'Список' я перехожу к строке:
			| "Код счета" | "Наименование счета" |
			| "111"       | "111"                |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Оборотно-сальдовая ведомость по счету МСФО"
		И я нажимаю на кнопку с именем 'СформироватьОтчет'
		И Я закрываю окно "Оборотно-сальдовая ведомость по счету МСФО"

	* Отчёт Анализ счёта МСФО

		И В командном интерфейсе я выбираю "Учет по МСФО" "Анализ счета МСФО"
		Тогда открылось окно "Анализ счета МСФО"
		И я нажимаю на кнопку с именем 'ВыбратьПериод1'
		Тогда открылось окно "Выбор периода"
		И я нажимаю на кнопку с именем 'ПерейтиНаГодНазадДоступно'
		И я нажимаю на кнопку с именем 'ПерейтиНаГодНазадДоступно'
		И я нажимаю на кнопку с именем 'ВыбратьГод'
		Тогда открылось окно "Анализ счета МСФО"
		И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент2Значение'
		Тогда открылось окно "План счетов МСФО"
		И в таблице 'Список' я перехожу к строке:
			| "Код счета" | "Наименование счета" |
			| "111"       | "111"                |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Анализ счета МСФО"
		И из выпадающего списка с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент10Значение' я выбираю точное значение "Магнус ООО"
		Тогда открылось окно "Анализ счета МСФО"
		И я нажимаю на кнопку с именем 'СформироватьОтчет'
		И Я закрываю окно "Анализ счета МСФО"

	* Отчёт Карточка счёта МСФО

		И В командном интерфейсе я выбираю "Учет по МСФО" "Карточка счета МСФО"
		Тогда открылось окно "Карточка счета МСФО"
		И я нажимаю на кнопку с именем 'ВыбратьПериод1'
		Тогда открылось окно "Выбор периода"
		И я нажимаю на кнопку с именем 'ПерейтиНаГодНазадДоступно'
		И я нажимаю на кнопку с именем 'ПерейтиНаГодНазадДоступно'
		И я нажимаю на кнопку с именем 'ВыбратьГод'
		Тогда открылось окно "Карточка счета МСФО"
		И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент2Значение'
		Тогда открылось окно "План счетов МСФО"
		И в таблице 'Список' я перехожу к строке:
			| "Код счета" | "Наименование счета" |
			| "111"       | "111"                |
		И в таблице 'Список' я выбираю текущую строку
		Тогда открылось окно "Карточка счета МСФО"
		И из выпадающего списка с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент9Значение' я выбираю точное значение "Магнус ООО"
		Тогда открылось окно "Карточка счета МСФО"
		И я нажимаю на кнопку с именем 'СформироватьОтчет'
		И Я закрываю окно "Карточка счета МСФО"

		
				
	* Отчёт Анализ субконто МСФО

		И В командном интерфейсе я выбираю "Учет по МСФО" "Анализ субконто МСФО"
		Тогда открылось окно "Анализ субконто МСФО"
		И я нажимаю на кнопку с именем 'ВыбратьПериод1'
		Тогда открылось окно "Выбор периода"
		И я нажимаю на кнопку с именем 'ПерейтиНаГодНазадДоступно'
		И я нажимаю на кнопку с именем 'ПерейтиНаГодНазадДоступно'
		И я нажимаю на кнопку с именем 'ВыбратьГод'
		Тогда открылось окно "Анализ субконто МСФО"
		И из выпадающего списка с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент11Значение' я выбираю точное значение "Магнус ООО"
		Тогда открылось окно "Анализ субконто МСФО"
		И я нажимаю на кнопку с именем 'СформироватьОтчет'
		И Я закрываю окно "Анализ субконто МСФО"

	* Отчёт Карточка субконто МСФО

		И В командном интерфейсе я выбираю "Учет по МСФО" "Карточка субконто МСФО"
		Тогда открылось окно "Карточка субконто МСФО"
		И я нажимаю на кнопку с именем 'ВыбратьПериод1'
		Тогда открылось окно "Выбор периода"
		И я нажимаю на кнопку с именем 'ПерейтиНаГодНазадДоступно'
		И я нажимаю на кнопку с именем 'ПерейтиНаГодНазадДоступно'
		И я нажимаю на кнопку с именем 'ВыбратьГод'
		Тогда открылось окно "Карточка субконто МСФО"
		И из выпадающего списка с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент10Значение' я выбираю точное значение "Магнус ООО"
		Тогда открылось окно "Карточка субконто МСФО"
		И я нажимаю на кнопку с именем 'СформироватьОтчет'
		И Я закрываю окно "Карточка субконто МСФО"

	* Отчёт по проводкам МСФО

		И В командном интерфейсе я выбираю "Учет по МСФО" "Отчет по проводкам МСФО"
		Тогда открылось окно "Отчет по проводкам МСФО"
		И я нажимаю на кнопку с именем 'ВыбратьПериод1'
		Тогда открылось окно "Выбор периода"
		И я нажимаю на кнопку с именем 'ПерейтиНаГодНазадДоступно'
		И я нажимаю на кнопку с именем 'ПерейтиНаГодНазадДоступно'
		И я нажимаю на кнопку с именем 'ВыбратьГод'
		Тогда открылось окно "Отчет по проводкам МСФО"
		И из выпадающего списка с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент8Значение' я выбираю точное значение "Магнус ООО"
		Тогда открылось окно "Отчет по проводкам МСФО"
		И я нажимаю на кнопку с именем 'СформироватьОтчет'
		И Я закрываю окно "Отчет по проводкам МСФО"
		
		
				
					
						
